увлекается("Катя", теннис).

увлекается("Виктор", теннис).

увлекается("Виктор", хоккей).

увлекается("Андрей", хоккей).

увлекается("Олег", хоккей).

увлекается("Ольга", теннис).

увлекается("Катя", шахматы).

увлекается("Олег", шахматы).

женщина("Катя").

женщина("Ольга").

мужчина("Виктор").

мужчина("Андрей").

мужчина("Олег").

% Правила
шахматы_жен(Кто):- увлекается(Кто, шахматы), женщина(Кто).

хоккей_муж(Кто):- увлекается(Кто, хоккей), мужчина(Кто).

теннис_пара(X, Y):- увлекается(X, теннис), увлекается(Y, теннис), мужчина(X), женщина(Y).

% Запросы
% шахматы_жен(Кто)

% хоккей_муж(Кто)

% теннис_пара(Кто1, Кто2)