родитель("Евдокия", "Алексей").
родитель("Михаил", "Алексей").

родитель("Мария", "Иоанн").
родитель("Мария", "Софья").
родитель("Мария", "Феодор").
родитель("Алексей", "Иоанн").
родитель("Алексей", "Софья").
родитель("Алексей", "Феодор").

родитель("Наталья", "Пётр").
родитель("Алексей", "Пётр").

родитель("Екатерина", "Анна").
родитель("Екатерина", "Елизавета").
родитель("Пётр", "Анна").
родитель("Пётр", "Елизавета").

% Файл 2

женщина("Евдокия").
женщина("Мария").
женщина("Наталья").
женщина("Екатерина").
женщина("Софья").
женщина("Анна").
женщина("Елизавета").

мужчина("Михаил").
мужчина("Алексей").
мужчина("Пётр").
мужчина("Феодор").
мужчина("Иоанн").

% Правила
мать(Кто, Кого):-родитель(Кто, Кого), женщина(Кто).

отец(Кто, Кого):-родитель(Кто, Кого), мужчина(Кто).

сын(Кто, Чей):-родитель(Чей, Кто), мужчина(Кто).

дочь(Кто, Чья):-родитель(Чья, Кто), женщина(Кто).

дед(Прародитель, Потомок):-родитель(Прародитель, Родитель), родитель(Родитель, Потомок), мужчина(Прародитель).

бабушка(Прародительница, Потомок):-родитель(Прародительница, Родитель), родитель(Родитель, Потомок), женщина(Прародительница).

брат(Кто, Чей):-сын(Кто, Предок), родитель(Предок, Чей),Кто\==Чей.

сестра(Кто, Чья):-дочь(Кто, Предок), родитель(Предок, Чья),Кто\==Чья.

внук(Кто, Чей):-сын(Кто, Х), родитель(Чей, Х)

% Запросы
%внук(Кто, "Евдокия").

%брат(Кто, "Иоанн").

%брат("Иоанн", Чей).
% to be fixed