страна("Россия").
страна("Казахстан").

столица("Россия", "Москва").
столица("Казахстан", "Астана").

население("Россия", 142957508).
население("Казахстан", 20575979).

континент("Россия", "Европа").
континент("Россия", "Азия").
континент("Казахстан", "Азия").

% Правила
справочник(Страна):-страна(Страна), write(Страна), write(" "),
    столица(Страна, Столица), write(Столица), write(" "),
    население(Страна, Население), write(Население), write(" "),
    континент(Страна, Континент), write(Континент), write(" "),
    nl, fail.

% население_выше(Страна, 20575970)
% население_выше(Страна, 20575980)
население_выше(Страна, Численность):-
    страна(Страна), население(Страна, Население),
    Население > Численность, write(Страна), nl, fail.

% население_невыше(Страна, 20575970)
% население_невыше(Страна, 20575980)
население_невыше(Страна, Численность):-
    страна(Страна), население(Страна, Население),
    \+ (Население > Численность), write(Страна), nl, fail.