страна("Россия").
страна("Казахстан").

столица("Россия", "Москва").
столица("Казахстан", "Астана").

население("Россия", 142957508).
население("Казахстан", 20575979).

континент("Россия", "Европа").
континент("Россия", "Азия").
континент("Казахстан", "Азия").


справочник(Страна):-страна(Страна), write(Страна), write(" "),
    столица(Страна, Столица), write(Столица), write(" "),
    население(Страна, Население), write(Население), write(" "),
    континент(Страна, Континент), write(Континент), write(" "),
    nl, fail.