% ученик(имя, класс) и увлекается(имя, хобби).
ученик("Андрей", "1А").
ученик("Алексей", "1Б").
ученик("Артём", "1Б").
ученик("1А_1", "1А").
ученик("1Б_1", "1Б").
ученик("1Б_2", "1Б").

увлекается("Андрей", "Кино").
увлекается("Алексей", "Кино").
увлекается("Артём", "Кино").
увлекается("1А_1", "Кино").

% Правила
увлекающиеся(Кто):-увлекается(Кто, Хобби), write("Имя: "),
    write(Кто), write(", увлекается: "), write(Хобби), nl, fail.

подбор(Класс):-ученик(Кто, Класс), увлекается(Кто, "Кино"),
    write("Имя: "), write(Кто), write(", потенциальная пара: "),
    ученик(Пара, КлассПары), Класс \== КлассПары, увлекается(Пара, "Кино"),
    write(Пара), nl, fail.