имя(витя).

имя(юра).

имя(миша).

место(1).

место(2).

место(3).

слева(X, Y):-место(X), место(Y), X < Y.

соответствие(X1, Y1, X2, Y2):-
    имя(X1), X1 = миша, место(Y1),
    имя(X2), X2 = юра, место(Y2),
    слева(Y1, Y2).

соответствие(X1, Y1, X2, Y2):-
    имя(X1), X1 = витя, место(Y1),
    имя(X2), X2 = миша, место(Y2),
    слева(Y1, Y2).

решение(X1, Y1, X2, Y2, X3, Y3):-
    X1 = витя, X2 = миша, X3 = юра,
    соответствие(X1, Y1, X2, Y2),
    соответствие(X2, Y2, X3, Y3),
    Y1 \== Y2, Y2 \== Y3, Y1 \== Y3.
