дерево(тополь).
дерево(береза).
дерево(липа).
дерево(клен).
дерево(сосна).
дерево(ель).

высота(1).
высота(2).
высота(3).
высота(4).
высота(5).
высота(6).

выше(X, Y):-высота(X), высота(Y), X > Y.
ниже(X, Y):-высота(X), высота(Y), X < Y.

соответствие(X1, Y1, X2, Y2):-
    дерево(X1), X1 = тополь, высота(Y1),
    дерево(X2), X2 = береза, высота(Y2),
    выше(Y1, Y2).

соответствие(X1, Y1, X2, Y2):-
    дерево(X1), X1 = береза, высота(Y1),
    дерево(X2), X2 = липа, высота(Y2),
    выше(Y1, Y2).

соответствие(X1, Y1, X2, Y2):-
    дерево(X1), X1 = клен, высота(Y1),
    дерево(X2), X2 = липа, высота(Y2),
    ниже(Y1, Y2).

соответствие(X1, Y1, X2, Y2):-
    дерево(X1), X1 = сосна, высота(Y1),
    дерево(X2), X2 = тополь, высота(Y2),
    выше(Y1, Y2).

соответствие(X1, Y1, X2, Y2):-
    дерево(X1), X1 = сосна, высота(Y1),
    дерево(X2), X2 = ель, высота(Y2),
    ниже(Y1, Y2).

решение(X1, Y1, X2, Y2, X3, Y3, X4, Y4, X5, Y5, X6, Y6):-
    X1 = тополь, X2 = береза, X3 = липа,
    X4 = клен, X5 = сосна, X6 = ель,
    соответствие(X1, Y1, X2, Y2),
    соответствие(X2, Y2, X3, Y3),
    соответствие(X4, Y4, X3, Y3),
    соответствие(X5, Y5, X1, Y1),
    соответствие(X5, Y5, X6, Y6).