фамилия(белокуров).
фамилия(рыжов).
фамилия(чернов).

цвет(белый).
цвет(рыжий).
цвет(чёрный).

номинальноеСоответствие(X1, Y1):-
    фамилия(X1), X1 = белокуров, цвет(Y1), Y1 = белый.
номинальноеСоответствие(X1, Y1):-
    фамилия(X1), X1 = рыжов, цвет(Y1), Y1 = рыжий.
номинальноеСоответствие(X1, Y1):-
    фамилия(X1), X1 = чернов, цвет(Y1), Y1 = чёрный.

реальноеСоответствие(X1, Y1):-
    фамилия(X1), цвет(Y1), номинальноеСоответствие(X1, Y2), Y1 \== Y2.

решение(X1, Y1, X2, Y2, X3, Y3):-
    X1 = белокуров, X2 = рыжов, X3 = чернов,
    реальноеСоответствие(X1, Y1),
    реальноеСоответствие(X2, Y2),
    реальноеСоответствие(X3, Y3),
    Y1 \== Y2, Y2 \== Y3, Y1 \== Y3.
